Revit 2027 API
SelectionChangedEventArgs.GetDocument Method
 Returns the document associated with this event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
See Also
Reference
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace